#strings

"""
1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
наприклад:
st = 'as 23 fdfdg544' введена строка
2,3,5,4,4        #вивело в консолі.
"""
st = 'as 23 fdfdg544f'
res = []
for i in st:
    if i.isnumeric():
        res.append(i)
print(','.join(res))

#################################################################################
"""
2)написати прогу яка вибирає зі введеної строки числа і виводить їх 
так як вони написані
наприклад:
  st = 'as 23 fdfdg544 34' #введена строка
  23, 544, 34              #вивело в консолі
  """
st1 = 'as 23 fdf33dg544 34a'
res1 = []
for i in st1:
    if i.isnumeric() or i==' ':
        res1.append(i)
print(','.join(''.join(res1).split()))
#################################################################################

# list comprehension
"""
1)є строка:
greeting = 'Hello, world'
записати кожний символ як окремий елемент списку і зробити його заглавним:
['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']
"""
greeting = 'Hello, world'
print(list(greeting.upper()))

"""
2) з диапозону від 0-50 записати тільки не парні числа при цьому піднести їх до квадрату
приклад:
[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
"""
l1=[i**2 for i in range(50) if i%2==1]
print(l1)

# function

# - створити функцію яка виводить ліст
def func():
    print(list)

# - створити функцію яка приймає три числа та виводить та повертає найбільше.
def num_max(a, b, c):
    print(max(a, b, c))
    return max(a, b, c)

# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
def num(*args):
    print(max(args))
    return min(args)

# - створити функцію яка повертає найбільше число з ліста
def num_max1(list):
    return max(list)

# - створити функцію яка повертає найменьше число з ліста
def num_min1(list):
    return min(list)
# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
def sum_list(list):
    return sum(list)

# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.

def sum_list1(list):
    return sum(list)/len(list)


################################################################################################
# 1)Дан list:
list = [22, 3,5,2,8,2,-23, 8,23,5]
# - знайти мін число
min_num = min(list)
# - видалити усі дублікати
list1=[]
for i in list:
    if i not in list1:
        list1.append(i)

# - замінити кожне 4-те значення на 'X'
for i in list1:
    if list1.index(i)%4==0:
        list1[list1.index(i)]='X'
print(list1)
# 2) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції
def square(a):
    for i in range(1, a+1):
        if i==1 or i==a:
            print('*'*a)
        else:
            print('*' + ' '*(a-2) + '*')

# 3) вывести табличку множення за допомогою цикла while
i=1
while i<10:
    j = 1
    while j<10:
        print(j*i, end='\t')
        j+=1
    i+=1
    print()

# 4) переробити це завдання під меню
